[
    {
        "id": 1,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور",
        "en": "O Allah! With Your Power we have come to the morning, with Your Power we come to the evening, with Your Power we live, and we die, and to You will we return",
        "source": "At-Tirmidhi"
    },

    {
        "id": 2,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "اللهم بك أمسينا، وبك نحيا، وبك نموت، وإليك المصير",
        "en": "O Allah! With Your Power, we have come to the evening, by You do we live, by You do we die, and to You is the return",
        "source": "At-Tirmidhi"
    },

    {
        "id": 3,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "اللهم أنْتَ رَبِّي لَا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وَ أنَا عَبْدُكَ، وَ أنَا عَلَى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوءُلَكَ بِنِعْمَتِكَ عَلَيَّ، وَ أبُوءُ بِذَنْبِي فَاغْفِرْ لي فَإنَّهُ لَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ",
        "en": "O Allah, You are my Lord, none has the right to be worshipped except You, You created me and I am Your servant and I abide to Your covenant and promise as best I can, I take refuge in You from the evil of which I have committed. I acknowledge Your favour upon me and I acknowledge my sins, so forgive me, for verily none can forgive sins except You.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 4,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "اللهم إنِّي أصْبَحْتُ أُشْهِدُكَ، وَ أُشْهِدُ حَمَلَةَ عَرْشِكَ، وَ مَلَائِكَتِكَ، وَ جَمِيْعَ خَلْقِكَ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، وَ أنَّ مُحَمَّداً عَبْدُكَ وَ رَسُولُكَ. [أرْبَعَ مَرَّاتٍ]",
        "en": "O Allah, verily I have reached the morning and call on You, the bearers of Your throne, Your angels, and all of Your creation to witness that You are Allah, none has the right to be worshipped except You, alone, without partner and that Muhammad is Your Servant and Messenger. [Four times]",
        "source": "Abû Dâwud"
    },

    {
        "id": 5,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "أللهم مَا أصْبَحَ بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ، فَلَكَ الحَمْدُ وَ لَكَ الشُّكْرُ.(١) و إذَا أمْسَى قَالَ: اللهم مَا أمْسَى بِي...",
        "en": "O Allah, what blessing I or any of Your creation have risen upon, is from You alone, without partner, so for You is all praise and unto You all thanks.",
        "source": "Abû Dâwud"
    },

    {
        "id": 6,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.[ثَلاثَ مَرَّاتٍ]",
        "en": "O Allah, grant my body health, O Allah, grant my hearing health, O Allah, grant my sight health. None has the right to be worshipped except You. O Allah, I take refuge with You from disbelief and poverty, and I take refuge with You from the punishment of the grave; none has the right to be worshipped except You. [Three times]",
        "source": "Abû Dâwud"
    },

    {
        "id": 7,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.[ثَلاثَ مَرَّاتٍ]",
        "en": "O Allah, grant my body health, O Allah, grant my hearing health, O Allah, grant my sight health. None has the right to be worshipped except You. O Allah, I take refuge with You from disbelief and poverty, and I take refuge with You from the punishment of the grave; none has the right to be worshipped except You. [Three times]",
        "source": "Abû Dâwud"
    },

    {
        "id": 8,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "حَسْبِيَ اللهُ لَا إلَهَ إلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ [سَبْعَ مَرَّاتٍ]",
        "en": "Allah is Sufficient for me, none has the right to be worshipped except Him, upon Him I rely and He is Lord of the exalted throne. [Seven times]",
        "source": "Ibn As-Sunnî"
    },

    {
        "id": 9,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "اللَّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في الدُّنْيَا وَالآخِرَةِ، اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في دِيْنِي وَدُنْيَايَ وَأهْلي وَمالي، اللَّهُمَّ اسْتُرْ عَوْرَاتي، وَآمِنْ رَوْعَاتي، اللَّهُمَّ احْفَظْني مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِي وَعَنْ شِمَالي، وَمِنْ فَوْقي ، وَ أعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحْتِي.",
        "en": "O Allah, I ask You for pardon and well-being in this life and the next. O Allah, I ask You for pardon and well-being in my religious and worldly affairs, and my family and my wealth. O Allah, veil my weaknesses and set at ease my dismay. O Allah, preserve me from the front and from behind and on my right and on my left and from above, and I take refuge in Your greatness lest I be swallowed up by the earth.",
        "source": "Abû Dâwud"
    },

    {
        "id": 10,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَ الأرْضِ، رَبَّ كلِّ شَيءٍ وَمَلِيْكَه، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
        "en": "O Allah, Knower of the unseen and the seen, Creator of the heavens and the Earth, Lord and Sovereign of all things, I bear witness that none has the right to be worshipped except You. I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 11,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "بِسمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيءٌ في الأرْضِ وَلَا في السَّمَاءِ وَهـوَ السَّمِيعُ العَلِيمُ [ثَلاثَ مَرَّاتٍ]",
        "en": "In the name of Allah with whose name nothing is harmed on earth nor in the heavens and He is The All-Seeing, The All-Knowing. [Three times]",
        "source": "Abû Dâwud"
    },

    {
        "id": 12,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "رَضِيْتُ بِاللهِ رَبًّا، وَبِالإسْلامِ دِيْناً، وَبِمُحَمَّدٍ نَبِيًّا [ثَلاثَ مَرَّاتٍ]",
        "en": "I am pleased with Allah as the Lord, and Islam as the religion and Muhammad as the Prophet. [Three times]",
        "source": "Abû Dâwud"
    },

    {
        "id": 13,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيْثُ، أَصْلِحْ لي شَأْني كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
        "en": "O Ever Living, O Self-Subsisting and Supporter of all, by Your mercy I seek assistance, rectify for me all of my affairs and do not leave me to myself, even for the blink of an eye.",
        "source": "Al-Hâkim"
    },

    {
        "id": 14,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "أَصْبَحْنَا وَ أَصْبَحَ المُلْكُ لِلَّهِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هـَذَا اليَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَ نُورَهُ، وَ بَرَكَتَهُ،وَ هُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهِ وَ شَرِّ مَا بَعْدَهُ. و إذا أمسى قال: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلّهَِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أسْأَلُكَ خَيْرَ هـَذِهِ اللَّيْلَةِ، فَتْحَهَا، وَنَصْرَهـَا، وَنورَهـَا وَبَرَكَتَهَا، وَ هُدَاهـَا، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهَا وَشَرِّ مَا بَعْدَهـَا.",
        "en": "We have reached the morning and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of this day, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of this day and the evil that follows it.' At night, recite instead: 'We have reached the evening and at this very time all sovereignty belongs to Allah, Lord of the worlds. O Allah, I ask You for the good of tonight, its triumphs and its victories, its light and its blessings and its guidance, and I take refuge in You from the evil of tonight and the evil that follows it.",
        "source": "Abû Dâwud"
    },

    {
        "id": 15,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "أَصْبَحْنَا عَلَى فِطْرَةِ الإسْلامِ، وَعَلَى كَلِمَةِ الإخْلاصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أبِيْنَا إِبْرَاهِيمَ، حَنِيْفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِيْنَ. وَ إذَا أمسَى قَالَ: أمْسَيْنَا عَلَى فِطْرَةِ الإسْلامِ.",
        "en": "We rise upon the fitrah of Islam, and the word of pure faith, and upon the religion of our Prophet Muhammad and the religion of our forefather Ibraheem, who was a Muslim and of true faith and was not of those who associate others with Allah.",
        "source": "Ibn As-Sunnî"
    },

    {
        "id": 16,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "سُبْحَانَ اللهِ وَبِحَمْدِهِ [مِئَةَ مَرَّةٍ]",
        "en": "How perfect Allah is and I praise Him. [One Hundred Times]",
        "source": "Muslim"
    },

    {
        "id": 17,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَرِيكَ لهُ، لهُ المُلْكُ ولهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. [عشر مرات](١)أو [مرة واحدة](٢).",
        "en": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. [Ten Times](١) or [Once](٢).",
        "source": "Abû Dâwud"
    },

    {
        "id": 18,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَريْكَ لهُ، لهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيْرٌ [مئةَ مَرَّةٍ إذا أصْبَحَ]",
        "en": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, and He is over all things omnipotent. [One hundred times in the morning]",
        "source": "Al-Bukhârî "
    },

    {
        "id": 19,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ ، وَمِدَادَ كَلِمَاتِهِ. [ثَلاثَ مَرَّاتٍ إذا أصْبَحَ]",
        "en": "How perfect Allah is and I praise Him by the number of His creation and His pleasure, and by the weight of His throne, and the ink of His words. [Three times in the morning]",
        "source": "Muslim"
    },

    {
        "id": 20,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَ رِزْقاً طَيِّباً، وَ عَمَلاً مُتَقَبَّلاً [إذا أصْبَحَ]",
        "en": "O Allah, I ask You for knowledge which is beneficial and sustenance which is good, and deeds which are acceptable. [In the morning]",
        "source": "Ibn As-Sunnî "
    },

    {
        "id": 21,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ [مِئَةَ مَرَّةٍ اليَوْمِ]",
        "en": "I seek Your forgiveness, Allah, and repent unto You. [One hundred times in a day]",
        "source": "Al-Bukhârî"
    },

    {
        "id": 22,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance said in the morning and evening",
        "ar": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ [ثَلاثَ مَرَّاتٍ إذا أمْسَى]",
        "en": "I take refuge in Allah's perfect words from the evil He has created. [Three times in the evening]",
        "source": "Aĥmad"
    },

    {
        "id": 23,
        "category": "Sleep & Wake up",
        "subcategory": "Upon waking up",
        "ar": "اَلحَمدُ لِلهِ الَّذِي أحيَانَا بَعْدَ مَا أمَاتَنَا وَ إِلَيهِ النُّشُورُ",
        "en": "Praise is to Allah Who gives us life after He has caused us to die and to Him is the return.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 24,
        "category": "Sleep & Wake up",
        "subcategory": "Upon waking up",
        "ar": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحاَنَ اللهِ، وَالحَمدُ للهِ، وَلَا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي",
        "en": "There is none worthy of worship but Allah alone, Who has no partner, His is the dominion and to Him belongs all praise, and He is able to do all things. Glory is to Allah. Praise is to Allah. There is none worthy of worship but Allah. Allah is the Most Great. There is no might and no power except by Allah's leave, the Exalted, the Mighty. My Lord, forgive me. (Whoever says this will be forgiven, and if he supplicates to Allah, his prayer will be answered; if he performs ablution and prays, his prayer will be accepted).",
        "source": "Al-Bukhârî"
    },

    {
        "id": 25,
        "category": "Sleep & Wake up",
        "subcategory": "Upon waking up",
        "ar": "يقرأ سورة آل عمران ٣: ١٩٠-٢٠٠",
        "en": "Recite Surah Al-'Imran [3:190-200].",
        "source": "Al-Bukhârî"
    },

    {
        "id": 26,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "سورة الْإِخْلَاص , سورة الفلق , سورة ٱلنَّاس [ثلاث مرات]  ",
        "en": "When retiring to his bed every night, the Prophet (PBUHH) would hold his palms together, (dry) spit in them, recite the last three chapters of the Qur'ân and then wipe over his entire body as much as possible with his hands, beginning with his head and face and then all parts of the body; he would do this three times.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 27,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ ",
        "en": "The Prophet (PBUH) also said: 'When you are about to sleep, recit Ayat Al-Kursî, for there will remain over you a protection from Allah and no devil will draw near you until morning.'",
        "source": "Al-Bukhârî"
    },

    {
        "id": 28,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "﴿ءَامَنَ ٱلرَّسُولُ بِمَآ أُنزِلَ إِلَيْهِ مِن رَّبِّهِۦ وَٱلْمُؤْمِنُونَ ۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيْنَ أَحَدٍۢ مِّن رُّسُلِهِۦ ۚ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ ٱلْمَصِيرُ ۝ لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا ٱكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَآ إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينَ﴾",
        "en": "The Prophet (PBUH) also said: 'Whoever recites the last two verses of Surah Al-Baqarah at night; those two verses shall be sufficient for him.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 29,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
        "en": "If one of you rises from his bed and then returns to it he should dust it with the edge of his garment three times for he does not know what has occurred in his absence and when he lies down he should supplicate:'In Your name my Lord, I lie down and in Your name I rise, so if You should take my soul then have mercy upon it, and if You should return my soul then protect it in the manner You do so with Your righteous servants.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 30,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسي وَأَنْتَ تَوَفَّاهـَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنَّي أَسْألُكَ العَافِيَةَ",
        "en": "O Allah, verily You have created my soul and You shall take its life, to You belongs its life and death. If You should keep my soul alive then protect it, and if You should take its life then forgive it. O Allah, I ask You to grant my good health.",
        "source": "Muslim"
    },

    {
        "id": 31,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "اللَّهُمَّ قِنِي عَذابَكَ، يَوْمَ تَبْعَثُ عِبَادَكَ",
        "en": "O Allah, protect me from Your punishment on the day Your servants are resurrected.",
        "source": "Abû Dâwud"
    },

    {
        "id": 32,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "بِاسْمِكَ اللَّهُمَّ أَموتُ وَأحْيَا",
        "en": "In Your name O Allah, I live and die.",
        "source": "Abû Dâwud"
    },

    {
        "id": 33,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "سُبْحَانَ اللهِ (ثَلاثاً وثَلاثِينَ) وَالحَمْدُ لِلَّهِ (ثَلاثاً وثَلاثِينَ) وَاللهُ أكْبرُ (أربَعاً وثَلاثِينَ)",
        "en": "How Perfect is Allah [Thirty-three times]. All praise is for Allah [Thirty-three times]. Allah is the Greatest [Thirty-four times]",
        "source": "Al-Bukhârî"
    },

    {
        "id": 34,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الأرْضِ، وربَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإنْجِيْلِ و الفُرْقَانِ، أَعوذُ بِكَ مِن شَرِّ كُلِّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ",
        "en": "O Allah, Lord of the seven heavens and the exalted throne, our Lord and Lord of all things, Splitter of the seed and the date stone, Revealer of the Tawrâh, the Injîl and the Furqân, I take refuge in You from the evil of all things You shall seize by the forelock. O Allah, You are The First so there is nothing before You and You are The Last so there is nothing after You. You are Až-Žâhir so there is nothing above You and You are Al-Baťin so there is nothing closer than You. Settle our debt for us and spare us from poverty.",
        "source": "Muslim"
    },

    {
        "id": 35,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "الحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
        "en": "All praise is for Allah, Who fed us and gave us drink, and Who is sufficient for us and has sheltered us, for how many have none to suffice them or shelter them.",
        "source": "Muslim"
    },

    {
        "id": 36,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "اللَّهُمَّ عالِمَ الغَيْبِ وَالشّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلَيْكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِن شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُـرَّهُ إِلَى مُسْلِمٍ",
        "en": "O Allah, Knower of the seen and the unseen, Creator of the heavens and the earth, Lord and Sovereign of all things I bear witness that none has the right to be worshipped except You. I take refuge in You from the evil of my soul and from the evil and shirk of the devil, and from committing wrong against my soul or bringing such upon another Muslim",
        "source": "Abû Dâwud"
    },

    {
        "id": 37,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "يَقْرَاُ ﴿الٓمٓ . تَنْزِيْلُ الْكِتَابِ...﴾ وَ ﴿تَبَارَكَ الَّذِي بِيَدِهِ المُلْكَ..﴾   ",
        "en": "Recite Sûrah As-Sajdah and Sûrah Al-Mulk. .",
        "source": "At-Tirmidhî"
    },

    {
        "id": 38,
        "category": "Sleep & Wake up",
        "subcategory": "Remembrance before sleeping",
        "ar": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
        "en": "O Allah, I submit my soul unto You, and I entrust my affair unto You, and I turn my face towards You, and I totally rely on You, in hope and fear of You. Verily there is no refuge nor safe haven from You except with You. I believe in Your Book which You have revealed and in Your Prophet whom You have sent.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 39,
        "category": "Sleep & Wake up",
        "subcategory": "Supplication when turning over during the night",
        "ar": "لَا إِلَهَ إِلَّا اللهُ الوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَالأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَـفَّارُ",
        "en": "None has the right to be worshipped except Allah, The One, AL-Qahhar. Lord of the heavens and the Earth and all between them, The Exalted in Might, The Oft-Forgiving.",
        "source": "Al-Hâkim"
    },

    {
        "id": 40,
        "category": "Sleep & Wake up",
        "subcategory": "Upon experiencing unrest, fear, apprehensiveness and the like during sleep",
        "ar": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ، مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأنْ يَحْضُرُونِ",
        "en": "I take refuge in the perfect words of Allah from His anger and punishment, and from the evil of His servants, and from the madness and appearance of devils.",
        "source": "Abû Dâwud"
    },

    {
        "id": 41,
        "category": "Daily Routine",
        "subcategory": "Supplication when wearing clothes",
        "ar": "اَلحَمدُ لِلهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَولٍ مِنِّي وَ لَا قُوَّةٍ",
        "en": "Praise is to Allah Who has clothed me with this (garment) and provided it for me, though I was powerless myself and incapable.",
        "source": "Abû Dâwud"
    },

    {
        "id": 42,
        "category": "Daily Routine",
        "subcategory": "Supplication when wearing new clothes",
        "ar": "اللَّهُمَّ لَكَ الحَمدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشِّرِ مَا صُنِعَ لَهُ",
        "en": "O Allah, for You is all praise, You have clothed me with it (i.e. the garment), I ask You for the good of it and the good for which it was made, and I seek refuge with You from the evil of it and the evil for which it was made.",
        "source": "Abû Dâwud"
    },

    {
        "id": 43,
        "category": "Daily Routine",
        "subcategory": "Supplication said to someone wearing new clothes",
        "ar": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
        "en": "May you wear it out and Allah replace it (with another).",
        "source": "Abû Dâwud"
    },

    {
        "id": 44,
        "category": "Daily Routine",
        "subcategory": "Supplication said to someone wearing new clothes",
        "ar": "إِلبَسْ جَدِيداً، وَعِشْ حَمِيداً، وَمُتْ شَهِيداً",
        "en": "Wear anew, live commendably and die a martyr.",
        "source": "Ibn Mâjah"
    },

    {
        "id": 45,
        "category": "Daily Routine",
        "subcategory": "Before Undressing",
        "ar": "بِسْمِ اللهِ",
        "en": "In the name of Allah",
        "source": "Abû Dâwud"
    },

    {
        "id": 46,
        "category": "Daily Routine",
        "subcategory": "Before entering the toilet",
        "ar": "(بِسْمِ اللهِ) اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
        "en": "(In the name of Allah). O Allah, I take refuge with you from all evil and evil-doers",
        "source": "Al-Bukhârî"
    },

    {
        "id": 47,
        "category": "Daily Routine",
        "subcategory": "After leaving the toilet",
        "ar": "غُفْرَانَكَ",
        "en": "I ask You (Allah) for forgiveness.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 48,
        "category": "Daily Routine",
        "subcategory": "When leaving home",
        "ar": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
        "en": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah.",
        "source": "Abû Dâwud"
    },

    {
        "id": 49,
        "category": "Daily Routine",
        "subcategory": "When leaving home",
        "ar": "اللَّهُمَّ إِنَّي أَعْوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضِلَّ، أَوْ أَزِلَّ، أُوْ أُزَلَّ أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
        "en": "O Allah, I take refuge with You lest I should stray or be led astray, or slip or be tripped, or oppress or be oppressed, or behave foolishly or be treated foolishly.",
        "source": ""
    },

    {
        "id": 50,
        "category": "Daily Routine",
        "subcategory": "Upon entering home",
        "ar": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللهِ رَبَّنَا تَوَكَّلْنَا",
        "en": "In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust.",
        "source": "Abû Dâwud"
    },

    {
        "id": 51,
        "category": "Food & Drink",
        "subcategory": "Upon breaking fast",
        "ar": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأجْرُ إِنْ شَاءَ اللهُ",
        "en": "The thirst has gone and the veins are quenched, and reward is confirmed, if Allah wills.",
        "source": "Abû Dâwud"
    },

    {
        "id": 52,
        "category": "Food & Drink",
        "subcategory": "Upon breaking fast",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ، أَنْ تَغْفِرَ لِي",
        "en": "O Allah, I ask You by Your mercy which envelopes all things, that You forgive me.",
        "source": "Ibn Mâjah"
    },

    {
        "id": 53,
        "category": "Food & Drink",
        "subcategory": "Supplication before eating",
        "ar": "بِسْمِ اللهِ (في أَوَّلِهِ وَآخِرِهِ)",
        "en": "In the name of Allah (in its beginning and end)*. * The words in the bracket are to be said if one forgets to recite the dua before eating and remembers while eating.",
        "source": "Abû Dâwud"
    },

    {
        "id": 54,
        "category": "Food & Drink",
        "subcategory": "Supplication before eating",
        "ar": "(١) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَأَطْعِمْنَا خَيْراً مِنْهُ (٢) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَزِدْنَا مِنْهُ",
        "en": "(1) 'O Allah, bless it for us and feed us better than it.' If one is given milk, recite the following instead: (2) 'O Allah, bless it fo it for usand give us more of it",
        "source": "Abû Dâwud"
    },

    {
        "id": 55,
        "category": "Food & Drink",
        "subcategory": "Upon completion of a meal",
        "ar": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هـَذَا، وَرَزَقَنِيْهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّة",
        "en": "All praise is for Allah who fed me this and provided it for me without any might nor power from myself.",
        "source": "Abû Dâwud"
    },

    {
        "id": 56,
        "category": "Food & Drink",
        "subcategory": "Upon completion of a meal",
        "ar": "الْحَمْدُ لِلَّهِ حَمْداً كَثِيْراً طَيِّباً مُبَارَكاً فِيْهِ، غَيْرَ [مَكْفِيٍّ وَلَا] مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبُّنَا",
        "en": "Allah be praised with an abundant beautiful blessed praise, a never-ending praise, a praise which we will never bid farewell to and an indispensable praise, He is our Lord.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 57,
        "category": "Food & Drink",
        "subcategory": "Supplication of the guest for the host",
        "ar": "اللَّهُمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ، وَارْحَمْهُمْ",
        "en": "O Allah, bless for them, that which You have provided them, forgive them and have mercy upon them.",
        "source": "Muslim"
    },

    {
        "id": 58,
        "category": "Food & Drink",
        "subcategory": "Supplication said to one offering a drink or to one who intended to do that",
        "ar": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي",
        "en": "O Allah, feed him who fed me, and provide with drink him who provided me with drink.",
        "source": "Muslim"
    },

    {
        "id": 59,
        "category": "Food & Drink",
        "subcategory": "Supplication said when breaking fast in someone's home",
        "ar": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ",
        "en": "May the fasting break their fast in your home, and may the dutiful and pious eat your food, and may the angles send prayers upon you.",
        "source": "Abû Dâwud"
    },

    {
        "id": 60,
        "category": "Food & Drink",
        "subcategory": "Supplication said by one fasting when presented with food and does not break his fast",
        "ar": "إذَا دُعِيَ أحَدُكُمْ فَلْيُجِبْ، فَإنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَ إنْ كَانَ مُفْطِراً فَلْيَطْعَمْ (وَ مَعنَى فَلْيُصَلِّ؛ أيْ: فَلْيَدْعُ)",
        "en": "If you are invited (to a meal) then accept. If you happen to be fasting, then pray (for those present) and if you are not fasting, then eat. (The meaning of 'pray' here means 'supplicate').",
        "source": "Muslim"
    },

    {
        "id": 61,
        "category": "Dua in Joy",
        "subcategory": "Supplication after receiving good or bad news",
        "ar": "(١) الحَمْدُ لِلَّهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ (٢) الحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
        "en": "Upon receiving good news, say: (1) 'All Praise is for Allah by whose favour good works are accomplished.' Upon receiving bad news, say: (2) 'All Praise is for Allah in all circumstances.",
        "source": "Ibn As-Sunnî"
    },

    {
        "id": 62,
        "category": "Dua in Joy",
        "subcategory": "What to say when startled",
        "ar": "لَا إلَهَ إلَّا اللهُ",
        "en": "None has the right to be worshipped except Allah.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 63,
        "category": "Dua in Joy",
        "subcategory": "What to say at times of amazement and delight",
        "ar": "سُبْحَانَ اللهِ!",
        "en": "How perfect is Allah!",
        "source": "Al-Bukhârî"
    },

    {
        "id": 64,
        "category": "Dua in Joy",
        "subcategory": "What to say at times of amazement and delight",
        "ar": "اللهُ أَكْبَرُ",
        "en": "Allah is the greatest.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 65,
        "category": "Dua in Joy",
        "subcategory": "What to do upon receiving pleasant news",
        "ar": "كَانَ النَّبِيُّ ﷺ إذَا أتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ؛ خَرَّ سَاجِداً شُكْراً لله تَبَارَكَ وَ تَعَالَى",
        "en": "The Prophet (PBUH) would prostrate in gratitude to Allah upon receiving news which pleased him or which caused pleasure.",
        "source": ""
    },

    {
        "id": 66,
        "category": "Dua in Distress",
        "subcategory": "Supplication for anxiety and sorrow",
        "ar": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلْبِي، وَنُورَ صَدْرِي، وجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
        "en": "O Allah, I am Your servant, son of Your servant, son of Your maidservant, my forelock is in Your hand, Your command over me is forever executed and Your decree over me is just. I ask You by every name belonging to You which You named Yourself with, or revealed in Your Book, or You taught to any of Your creation, or You have preserved in the knowledge of the unseen with You, that You make the Quran the life of my heart and the light of my breast, and a departure for my sorrow and a release for my anxiety.",
        "source": "Aĥmad"
    },

    {
        "id": 67,
        "category": "Dua in Distress",
        "subcategory": "Supplication for anxiety and sorrow",
        "ar": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْـزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ",
        "en": "O Allah, I take refuge in You from anxiety and sorrow, weakness and laziness, miserliness and cowardice, the burden of debts and from being over powered by men.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 68,
        "category": "Dua in Distress",
        "subcategory": "Supplication for one in distress",
        "ar": "لَا إلَهَ إِلَّا اللَّهُ الْعَظِيْمُ الْحَلِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ العَرْشِ العَظِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الكَرِيْمِ",
        "en": "None has the right to be worshipped except Allah Forbearing. None has the right to be worshipped except Allah, Lord of the magnificent throne. None has the right to be worshipped except Allah, Lord of the heavens, Lord of the Earth and Lord of the noble throne.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 69,
        "category": "Dua in Distress",
        "subcategory": "Supplication for one in distress",
        "ar": "اللَّهُمَّ رَحْمَتَكَ أَرْجـُو، فَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أنْتَ",
        "en": "O Allah, it is Your mercy that I hope for, so do not leave me in charge of my affairs even for a blink of an eye and rectify for me all of my affairs. None has the right to be worshipped except You.",
        "source": "Abû Dâwud"
    },

    {
        "id": 70,
        "category": "Dua in Distress",
        "subcategory": "Supplication for one in distress",
        "ar": "لَا إِلَهَ إِلَّا أنْتَ سُبْحَانَكَ، إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ",
        "en": "None has the right to be worshipped except You. How perfect You are, verily I was among the wrong-doers.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 71,
        "category": "Dua in Distress",
        "subcategory": "Supplication for one in distress",
        "ar": "اللهُ اللهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً",
        "en": "Allah, Allah is my Lord, I do not associate anything with Him.",
        "source": "Abû Dâwud"
    },

    {
        "id": 72,
        "category": "Dua in Distress",
        "subcategory": "Upon encountering an enemy or those of authority",
        "ar": "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيْرِي، بِكَ أَحُولُ، وَبِكَ أَصُولُ، وَبِكَ أُقَاتِلُ",
        "en": "O Allah, You are my supporter and You are my helper, by You I move and by You I attack and by You I battle.",
        "source": "Abû Dâwud"
    },

    {
        "id": 73,
        "category": "Dua in Distress",
        "subcategory": "Upon encountering an enemy or those of authority",
        "ar": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهـِمْ",
        "en": "O Allah, we place You before them and we take refuge in You from their evil.",
        "source": "Abû Dâwud"
    },

    {
        "id": 74,
        "category": "Dua in Distress",
        "subcategory": "Upon encountering an enemy or those of authority",
        "ar": "حَسْبُنَا اللهُ، وَنِعْمَ الوَكِيْلُ",
        "en": "Allah is sufficient for us, and how fine a trustee (He is).",
        "source": "Al-Bukhârî"
    },

    {
        "id": 75,
        "category": "Dua in Distress",
        "subcategory": "For fear of the opression of rulers",
        "ar": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَ رَبَّ العَرْشِ العَظِيْمِ، كُنْ لِي جَاراً مِنْ فُلَانِ بْنِ فُلَانٍ، وَ أَحْزَابِهِ مِنْ خَلائِقِكَ؛ أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنهُمْ أوْ يَطْغَى، عَزَّ جَارُكَ، وَ جَلَّ ثَنَائُكَ، وَ لَا إِلَهَ إِلَّا أَنْتَ",
        "en": "O Allah, Lord of the seven heavens and the earth and the great throne, protect me from so-and-so [tell the name of the person] and from his allies among your creatures, and from being subjected by their abuse or tyranny. Honoured is one under your protection, exalted is Your praise, none has the right to be worshipped except You.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 76,
        "category": "Dua in Distress",
        "subcategory": "For fear of the opression of rulers",
        "ar": "اللهُ أَكْبَرُ، اللهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيْعًا، اللهُ أَعَزُّ مِمَّا أَخَافُ وَ أَحْذَرُ، أَعُوذُ باللهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضِ إِلَّا بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وُجُنُودِهِ وَ أَتْبَاعِهِ وَ أَشْيَاعِهِ، مِنَ الْجِنِّ وَ الإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُك، وَ عَزَّ جَارُكَ، وَ تَبَارَكَ اسْمُكَ: وَ لَا إِلَهَ غَيْرُكَ. [ثَلاثَ مَرَّاتٍ]",
        "en": "Allah is the greatest, Allah is mightier than all things. Allah is mightier than the one I'm afraid of and I mistrust. I take refuge in Allah, none has the right to be worshipped except Allah, who hold back the seven heavens from falling on earth except when he'll allowed this, from the misdeeds of You slave so-and-so [tell the name of the person], from his soldiers, from his partisans among the jinns and the human beings. Ô Lord ! Be my protector from their misdeeds. Exalted is Your praise, honoured is Your protected, blessed is Your name and none has the right to be worshipped except You.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 77,
        "category": "Dua in Distress",
        "subcategory": "Against enemies",
        "ar": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الأحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُمْ",
        "en": "O Allah, Revealer of the Book, Swift at reckoning, defeat the confederates. O Allah, defeat them and convulse them.",
        "source": "Muslim"
    },

    {
        "id": 78,
        "category": "Dua in Distress",
        "subcategory": "When afraid of a group people",
        "ar": "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
        "en": "O Allah, protect me from them with what You choose.",
        "source": "Muslim"
    },

    {
        "id": 79,
        "category": "Dua in Distress",
        "subcategory": "Supplication for one afflicted with doubt in his faith",
        "ar": "(1) يَسْتَعِيْذُ بِاللهِ (2) يَنْتَهِي عَمَّا وَسْوَسَ فِيْهِ",
        "en": "(1) Seek refuge with Allah from Shayťân. (2) Renounce that which is causing such doubt.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 80,
        "category": "Dua in Distress",
        "subcategory": "Supplication for one afflicted with doubt in his faith",
        "ar": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
        "en": "I have believed in Allah and His Messenger.",
        "source": "Muslim"
    },

    {
        "id": 81,
        "category": "Dua in Distress",
        "subcategory": "Supplication for one afflicted with doubt in his faith",
        "ar": "﴿هُوَ الأوَّلُ وَالآخِـرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴾ ",
        "en": "He is The First and The Last, Ath-Thahir and Al-Batin and He knows well all things.",
        "source": "Sûrah Al-Ĥadîd : 3"
    },

    {
        "id": 82,
        "category": "Dua in Distress",
        "subcategory": "Settling a debt",
        "ar": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
        "en": "O Allah, make what is lawful enough for me, as opposed to what is unlawful, and spare me by Your grace, of need of others.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 83,
        "category": "Dua in Distress",
        "subcategory": "Supplication for one afflicted by a calamity",
        "ar": "إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أجِرْنِي فِي مُصِيْبَتِي، وَ أخْلِفْ لِي خَيْراً مِنْهَا",
        "en": "To Allah we belong and unto Him is our return.O Allah, recompense me for my affliction and replace it for me with something better.",
        "source": "Muslim"
    },

    {
        "id": 84,
        "category": "Dua in Distress",
        "subcategory": "Supplication for fear of Shirk",
        "ar": "اللَّهُمَّ إِنِّي أَعُوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
        "en": "O Allah, I take refuge in You lest I should commit shirk with You knowingly and I seek Your forgiveness for what I do unknowingly.",
        "source": "Aĥmad"
    },

    {
        "id": 85,
        "category": "Dua in Distress",
        "subcategory": "Forbiddance of ascribing things to omens",
        "ar": "اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ، وَلَا خَيْرَ إِلَّا خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ",
        "en": "O Allah, there is no omen but there is reliance on You, there is no good except Your good and none has the right to be worshipped except You.",
        "source": "Aĥmad"
    },

    {
        "id": 86,
        "category": "Travel",
        "subcategory": "Supplication said when mounting an animal or any means of transport",
        "ar": "بِسْمِ اللهِ، وَالْحَمْدُ لِلَّهِ ﴿سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴾ الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِيْ، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
        "en": "In the name of Allah and all praise is for Allah. How perfect He is, the One Who has placed this (transport) at our service and we ourselves would not have been capable of that, and to our Lord is our final destiny. All praise is for Allah, All praise is for Allah, All praise is for Allah, Allah is the greatest, Allah is the greatest, Allah is the greatest. How perfect You are, O Allah, verily I have wronged my soul, so forgive me, for surely none can forgive sins except You.",
        "source": "Abû Dâwud"
    },

    {
        "id": 87,
        "category": "Travel",
        "subcategory": "Supplication for travel",
        "ar": "(١) اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ ﴿سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴾ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيْفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكآبَةِ الْمَنْظَرِ وَسُوءِ المُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ (٢) آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
        "en": "(1) Allah is the greatest, Allah is the greatest, Allah is the greatest, How perfect He is, The One Who has placed this (transport) at our service, and we ourselves would not have been capable of that, and to our Lord is our final destiny. O Allah, we ask You for birr and taqwa in this journey of ours, and we ask You for deeds which please You. O Allah, facilitate our journey and let us cover it's distance quickly. O Allah, You are The Companion on the journey and The Successor over the family, O Allah, I take refuge with You from the difficulties of travel, from having a change of hearts and being in a bad predicament, and I take refuge in You from an ill fated outcome with wealth and family. Upon returning the same supplication is recited with the following addition: (2) 'We return, repent, worship and praise our Lord.",
        "source": "Muslim"
    },

    {
        "id": 88,
        "category": "Travel",
        "subcategory": "Supplication upon entering a town or village, etc..",
        "ar": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرْاضِيْنَ السَّبْعِ وَمَا أقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيْهَا",
        "en": "O Allah, Lord of the seven heavens and all that they envelop, Lord of the seven earths and all that they carry, Lord of the devils and all whom they misguide, Lord of the winds and all whom they whisk away. I ask You for the goodness of this village, the goodness of its inhabitants and for all the goodness found within it and I take refuge with You from the evil of this village, the evil of its inhabitants and from all the evil found within it.",
        "source": "Al-Hâkim"
    },

    {
        "id": 89,
        "category": "Travel",
        "subcategory": "When entering the market",
        "ar": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، يُحْيِي وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
        "en": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise. He gives life and causes death, and He is living and does not die. In His hand is all good and He is over all things, omnipotent.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 90,
        "category": "Travel",
        "subcategory": "Supplication for when the mounted animal (or means of transport) stumbles",
        "ar": "بِسْمِ اللهِ",
        "en": "In the name of Allah.",
        "source": "Abû Dâwud"
    },

    {
        "id": 91,
        "category": "Travel",
        "subcategory": "Supplication of the traveller for the resident",
        "ar": "أَسْتَوْدِعُكُمُ اللَّهَ، الَّذِيْ لَا تَضِيْعُ وَدَائِعُهُ",
        "en": "I place you in the trust of Allah, whose trust is never misplaced.",
        "source": "Aĥmad"
    },

    {
        "id": 92,
        "category": "Travel",
        "subcategory": "Supplication of the resident for the traveller",
        "ar": "أَسْتَوْدِعُ اللَّهَ دِيْنَكَ، وَأَمَانَتَكَ، وَخَوَاتِيْمَ عَمَلِكَ",
        "en": "I place your religion, your faithfulness and the ends of your deeds in the trust of Allah.",
        "source": "Aĥmad"
    },

    {
        "id": 93,
        "category": "Travel",
        "subcategory": "Supplication of the resident for the traveller",
        "ar": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَ ذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُمَا كُنْتَ",
        "en": "May Allah endow you with taqwa, forgive your sins and facilitate all good for you, wherever you be.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 94,
        "category": "Travel",
        "subcategory": "Remembrance while ascending or descending",
        "ar": "(١) اللهُ أَكْبَرُ(٢) سُبْحَانَ اللهُ",
        "en": "When ascending, recite (1) 'Allah is the greatest', and when descending, recite (2) 'How perfect is Allah'.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 95,
        "category": "Travel",
        "subcategory": "Prayer of the traveller as dawn approaches",
        "ar": "سَمَّعَ سَامِعٌ بِحَمْدِ اللهِ، وَحُسْنِ بَلائِهِ عَلَيْنَا،.رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا عَائِذاً باللهِ مِنَ النَّارِ",
        "en": "May a witness, be witness to our praise of Allah for His favours and bounties upon us. Our Lord, protect us, show favour on us and deliver us from every evil. I take refuge in Allah from the fire.",
        "source": "Muslim"
    },

    {
        "id": 96,
        "category": "Travel",
        "subcategory": "Stopping or lodging somewhere",
        "ar": "أَعُوذُ بِكَلِمَاتِ اللّهِِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
        "en": "I take refuge in Allah's perfect words from the evil that He has created.",
        "source": "Muslim"
    },

    {
        "id": 97,
        "category": "Travel",
        "subcategory": "While returning from travel",
        "ar": "اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لهُ المُلْكُ وَ لَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حـَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأحْزَابَ وَحْدَهُ",
        "en": "Allah is the greatest, Allah is the greatest, Allah is the greatest. None has the right to be worshipped except Allah, alone, without partner. To Him belongs all sovereignty and praise, and He is over all things omnipotent. We return, repent, worship and praise our Lord. Allah fulfilled His promise, aided His Servant, and single-handedly defeated the allies.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 98,
        "category": "Prayer & Masjid",
        "subcategory": "When starting ablution (wudu')",
        "ar": "بِسْمِ اللهِ",
        "en": "In the name of Allah.",
        "source": "Abû Dâwud"
    },

    {
        "id": 99,
        "category": "Prayer & Masjid",
        "subcategory": "Upon completing ablution (wudu')",
        "ar": "أَشْهَدُ أَنْ لَّا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
        "en": "I bear witness that none has the right to be worshipped except Allah, Alone, without partner, and I bear witness that Muhammad is His slave and Messenger.",
        "source": "Muslim"
    },

    {
        "id": 100,
        "category": "Prayer & Masjid",
        "subcategory": "Upon entering the masjid",
        "ar": "(يَبْدَأُ بِرِجْلِهِ اليُمْنَى)(١)، ويقول: (أَعُوْذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ)(٢)، (بِسْمِ اللَّهِ, وَالصَّلاةُ)(٣). [وَالسَّلامُ عَلَى رَسُوْلِ اللَّهِ](٤)، (اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)(٥).",
        "en": "(Enter with your right foot)(١), and then say: (I take refuge with Allah, The Supreme and with His Noble Face, and His eternal authority from the accursed devil.)(٢) , (In the name of Allah, and prayers)(٣)[and peace be upon the Messenger of Allah](٤), (O Allah, open the gates of Your mercy for me)(٥).",
        "source": "Al-Hâkim"
    },

    {
        "id": 101,
        "category": "Prayer & Masjid",
        "subcategory": "Upon leaving the masjid",
        "ar": "(يَبْدَأُ بِرِجْلِهِ الْيُسْرَى)(١)، وَ يَقُولُ: (بِسْمِ اللهِ وَ الصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللهِ، اللهم إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللهم اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيْمِ)(٢). ",
        "en": "(Leave with your left foot)(١), and then say: (In the name of Allah, and prayers and peace be upon the Messenger of Allah. O Allah, I ask You from Your favor. O Allah, guard me from the accursed devil)(٢).",
        "source": "Al-Hâkim"
    },

    {
        "id": 102,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications related to the Athân (call to prayer)",
        "ar": "يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إلَّا فِي «حَيَّ عَلَى الصَّلاةِ» وَ «حَيَّ عَلَى الفَلاحِ» فَيَقُولُ: «لَا حَولَ وَ لَا قُوَّةَ إلَّا بِاللهِ».",
        "en": "One repeats just as the muadhdhin (One who calls to prayers) says, except when he says “come to prayer” or “come to success”, one should say “There is no might nor power except with Allah”. ",
        "source": "Al-Bukhârî"
    },

    {
        "id": 103,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications at the start of Ŝalâh (prayer)",
        "ar": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ.",
        "en": "O Allah, distance me from my sins just as You have distanced The East from The West, O Allah, purify me of my sins as a white robe is purified of filth, O Allah cleanse me of my sins with snow, water, and ice.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 104,
        "category": "Prayer & Masjid",
        "subcategory": "While bowing in Ŝalâh (Rukû')",
        "ar": "سُبْحَانَ رَبِّيَ الْعَظِيمِ (ثلاثا) ",
        "en": "How perfect my Lord is, The Supreme. (Three times)",
        "source": "Abû Dâwud"
    },

    {
        "id": 105,
        "category": "Prayer & Masjid",
        "subcategory": "While bowing in Ŝalâh (Rukû')",
        "ar": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْلِي",
        "en": "How perfect You are O Allah, our Lord and I praise You. O Allah, forgive me.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 106,
        "category": "Prayer & Masjid",
        "subcategory": "While bowing in Ŝalâh (Rukû')",
        "ar": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ.",
        "en": "Perfect and Holy (He is), Lord of the angels and the Ruuh (i.e. Jibreel).",
        "source": "Muslim"
    },

    {
        "id": 107,
        "category": "Prayer & Masjid",
        "subcategory": "While bowing in Ŝalâh (Rukû')",
        "ar": "اللَّهُمَّ لَكَ رَكَعْتُ ، وَبِكَ آمَنْتُ ، وَلَكَ أَسْلَمْتُ ، خَشَعَ لَكَ سَمْعِي ، وَبَصَرِي ، وَمُخِّي ، وَعَظْمِي ، وَعَصَبِي ، [وَمَا اسْتَقَلَّت بِهِ قَدَمِي]",
        "en": "O Allah, unto You I have bowed, and in You I have believed, and to You I have submitted. My hearing, sight, mind, bones, tendons and what my feet carry are humbled before You.",
        "source": "Muslim"
    },

    {
        "id": 108,
        "category": "Prayer & Masjid",
        "subcategory": "While bowing in Ŝalâh (Rukû')",
        "ar": "سُبْحَانَ ذِي الْجَبَروتِ ، وَالْمَلَكُوتِ ، وَالكِبْرِيَاءِ ، وَالْعَظَمَةِ.",
        "en": "How perfect He is, The Possessor of total power, sovereignty, magnificence and grandeur.",
        "source": "Abû Dâwud"
    },

    {
        "id": 109,
        "category": "Prayer & Masjid",
        "subcategory": "Upon rising from Rukû' (bowing position in Ŝalâh)",
        "ar": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ.",
        "en": "May Allah answer he who praises Him.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 110,
        "category": "Prayer & Masjid",
        "subcategory": "Upon rising from Rukû' (bowing position in Ŝalâh)",
        "ar": "رَبَّنَا وَلَكَ الْحَمْدُ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.",
        "en": "Our Lord, for You is all praise, an abundant beautiful blessed praise.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 111,
        "category": "Prayer & Masjid",
        "subcategory": "Upon rising from Rukû' (bowing position in Ŝalâh)",
        "ar": "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمَا بَيْنَهُمَا ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ ، أَهْلَ الثَّنَاءِ وَالْمَجْدِ ، أَحَقُّ مَا قَالَ الْعَبْدُ ، وَكُلُّنَا لَكَ عَبْدٌ ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَامُعْطِي لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.",
        "en": "The heavens and the Earth and all between them abound with Your praises, and all that You will abounds with Your praises. O Possessor of praise and majesty, the truest thing a slave has said (of You) and we are all Your slaves. O Allah, none can prevent what You have willed to bestow and none can bestow what You have willed to prevent, and no wealth or majesty can benefit anyone, as from You is all wealth and majesty.",
        "source": "Muslim"
    },

    {
        "id": 112,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications while in Sujûd (prostration in Ŝalâh)",
        "ar": "سُبْحَانَ رَبَّيَ الأَعْلَى (ثلاثا)",
        "en": "How Perfect my Lord is, The Most High. (Three times)",
        "source": "Abû Dâwud"
    },

    {
        "id": 113,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications while in Sujûd (prostration in Ŝalâh)",
        "ar": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
        "en": "How Perfect You are O Allah, our Lord, and I praise You. O Allah, forgive me.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 114,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications while in Sujûd (prostration in Ŝalâh)",
        "ar": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ",
        "en": "Perfect and Holy (He is), Lord of the angles and the Ruuh (i.e. Jibreel).",
        "source": "Muslim"
    },

    {
        "id": 115,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications while in Sujûd (prostration in Ŝalâh)",
        "ar": "اللَّهُمَّ لَكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهَ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الخَالِقِينَ",
        "en": "O Allah, unto You I have prostrated and in You I have believed, and unto You I have submitted. My face has prostrated before He Who created it and fashioned it, and brought forth its faculties of hearing and seeing. Blessed is Allah, the Best of creators.",
        "source": "Muslim"
    },

    {
        "id": 115,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications while in Sujûd (prostration in Ŝalâh)",
        "ar": "اللًّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلانِيَتَهُ وَسِرَّهُ",
        "en": "O Allah, forgive me all of my sins, the small and great of them, the first and last of them, and the seen and hidden of them.",
        "source": "Muslim"
    },

    {
        "id": 116,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications while in Sujûd (prostration in Ŝalâh)",
        "ar": "اللَّهُمَّ إِنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوْذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
        "en": "O Allah, I take refuge within Your pleasure from Your displeasure and within Your pardon from Your punishment, and I take refuge in You from You. I cannot enumerate Your praise. You are as You have praised Yourself.",
        "source": "Muslim"
    },

    {
        "id": 117,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications between sajdatain (two prostrations)",
        "ar": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
        "en": "My Lord forgive me, My Lord forgive me.",
        "source": "Abû Dâwud"
    },

    {
        "id": 118,
        "category": "Prayer & Masjid",
        "subcategory": "Supplications between sajdatain (two prostrations)",
        "ar": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
        "en": "O Allah, forgive me, have mercy upon me, guide me, enrich me, give me health, grant me sustenance and raise my rank.",
        "source": "Abû Dâwud"
    },

    {
        "id": 119,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication for Sajdah (prostration) due to recitation of Qur'an",
        "ar": "سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ (فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ)",
        "en": "My face fell prostrate before He who created it and brought forth its faculties of hearing and seeing by His might and power (So Blessed is Allah, the best of creators).",
        "source": "At-Tirmidhî"
    },

    {
        "id": 120,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication for Sajdah (prostration) due to recitation of Qur'an",
        "ar": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
        "en": "O Allah, record for me a reward for this (prostration), and remove from me a sin. Save it for me and accept it from me just as You had accepted it from Your servant Dâwud.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 121,
        "category": "Prayer & Masjid",
        "subcategory": "",
        "ar": "",
        "en": "",
        "source": ""
    },

    {
        "id": 122,
        "category": "Prayer & Masjid",
        "subcategory": "Dua of Tashahhud",
        "ar": "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ، وَالطَّيِّبَاتُ، السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ،. أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
        "en": "Al-Tahiyyât is for Allah. All acts of worship and good deeds are for Him. Peace and the mercy and blessings of Allah be upon you O Prophet. Peace be upon us and all of Allah’s righteous servants. I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger",
        "source": "Al-Bukhârî"
    },

    {
        "id": 123,
        "category": "Prayer & Masjid",
        "subcategory": "Dua for the Prophet (salla Allaahu ʻalayhi wa salaam) after the Tashahhud",
        "ar": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
        "en": "O Allah, send prayers upon Muhammad and the followers of Muhammad, just as You sent prayers upon Ibrahim and upon the followers of Ibrahim. Verily, You are full of praise and majesty. O Allah, send blessings upon Muhammad and upon the family of Muhammad, just as You send blessings upon Ibrahim and upon the family of Ibrahim. Verily, You are full of praise and majesty.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 124,
        "category": "Prayer & Masjid",
        "subcategory": "Dua for the Prophet (salla Allaahu ʻalayhi wa salaam) after the Tashahhud",
        "ar": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَ عَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
        "en": "O Allah, send prayers upon Muhammad and upon the wives and descendants of Muhammad, just as You sent prayers upon the family of Ibrahim, and send blessings upon Muhammad and upon the wives and descendants of Muhammad, just as You sent blessings upon the family of Ibrahim. Verily, You are full of praise and majesty.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 125,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
        "en": "O Allah, I take refuge in You from the punishment of the grave, from the torment of the Fire, from the trials and tribulations of life and death and from the evil affliction of Al-Masîh Ad-Dajjâl.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 126,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
        "en": "O Allah, I take refuge in You from the punishment of the grave, and I take refuge in You from the temptation and trial of Al-Masîĥ Ad-Dajjâl, and I take refuge in You from the trials and tribulations of life and death. O Allah, I take refuge in You from sin and debt.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 127,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرةً مِنْ عِنْدِكَ، وَارْحَمْني، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
        "en": "O Allah, I have indeed oppressed my soul excessively and none can forgive sin except You, so forgive me a forgiveness from Yourself and have mercy upon me. Surely, You are The Most-Forgiving, The Most-Merciful.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 128,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ إِنِّي أَسأَلُكَ بِأَنَّ لَكَ الْحَمْدُ، لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيْعَ السَّمَوَاتِ وَالأَرْضِ، يَاذَا الْجَلالِ وَالإكْرَامِ، يَاحَيُّ يَاقَيُّومُ، إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنَ النَّارِ",
        "en": "O Allah, I ask You as unto You is all praise, none has the right to be worshipped except You, alone, without partner. You are the Benefactor. O Originator of the heavens and the Earth, O possessor of majesty and honor, O Ever Living, O Self-Subsisting and Supporter of all, verily I ask You for Paradise and I take refuge with You from the Fire.",
        "source": "Abû Dâwud"
    },

    {
        "id": 129,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ",
        "en": "O Allah, forgive me for those sins which have come to pass as well as those which shall come to pass, and those I have committed in secret as well as those I have made public, and where I have exceeded all bounds as well as those things about which You are more knowledgeable. You are Al-Muqaddim and Al-Mu’akhkhir. None has the right to be worshipped except You.",
        "source": "Muslim"
    },

    {
        "id": 130,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
        "en": "O Allah, help me to remember You, to thank You, and to worship You in the best of manners.",
        "source": "Abû Dâwud"
    },

    {
        "id": 131,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ البُخْلِ، وَأَعُوذُبِكَ مِنَ الْجُبْنِ، وَأَعُوْذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ",
        "en": "O Allah, I take refuge in You from miserliness and cowardice, I take refuge in You lest I be returned to the worst of lives. And I take refuge in You from the trails and tribulations of this life and the punishment of the grave.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 132,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنْ النَّارِ",
        "en": "O Allah, I ask You to grant me Paradise and I take refuge in You from the Fire.",
        "source": "Abû Dâwud"
    },

    {
        "id": 133,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ؛ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرَّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيَّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
        "en": "O Allah, by Your knowledge of the unseen and Your power over creation, keep me alive so long as You know such life to be good for me and take me if You know death to be better for me. O Allah, make me fearful of You whether in secret or in public and I ask You to make me true in speech, in times of pleasure and anger. I ask You to make me moderate in times of wealth and poverty and I ask You for everlasting bliss and joy which will never cease. I ask You to make me pleased with what You have decreed and for an easy life after death. I ask You for the sweetness of looking upon Your Face and a longing to encounter You in a manner which does not entail a calamity which will bring about harm or a trial which will cause deviation. O Allah, beautify us with the adornment of faith and make us of those who guide and are rightly guided.",
        "source": "An-Nisâ'i"
    },

    {
        "id": 134,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ بِأَنَّكَ الْوَاحِدُ الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
        "en": "O Allah, I ask You O Allah, as You are – The One, The Only, Aŝ-Ŝamad, The One who begets not, nor was He begotten and there is none like unto Him- that You forgive me my sins for verily You are The Oft-Forgiving, Most-Merciful.",
        "source": "An-Nisâ'i"
    },

    {
        "id": 135,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication to be said after the last Tashahhud and before the Taslîm",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
        "en": "O Allah, I ask You, as I bear witness that You are Allah, none has the right to be worshipped except You, The One, Aŝ-Ŝamad Who begets not nor was He begotten and there is none like unto Him.",
        "source": "Abû Dâwud"
    },

    {
        "id": 136,
        "category": "Prayer & Masjid",
        "subcategory": "Remembrance after the Taslîm",
        "ar": "(١) أَسْتَغْفِرُ اللَّهَ (ثلاثا)(٢) اللَّهُمَّ أَنْتَ السَّلامُ وَمِنْكَ السَّلامُ تَبَارَكْتَ يَاذَا الجَلالِ وَالإكْرَامِ",
        "en": "(1) I ask Allah for forgiveness (Three times) (2) O Allah, You are As-Salam and from You is all peace, blessed are You, O Possessor of Majesty and Honor.",
        "source": "Muslim"
    },

    {
        "id": 137,
        "category": "Prayer & Masjid",
        "subcategory": "Remembrance after the Taslîm",
        "ar": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ(ثلاثاً)، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ",
        "en": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. O Allah, none can prevent what You have willed to bestow and none can bestow what You have willed to prevent, and no wealth or majesty can benefit anyone, as from You is all wealth and majesty.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 138,
        "category": "Prayer & Masjid",
        "subcategory": "Remembrance after the Taslîm",
        "ar": "لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، لاَ إِلَهَ إِلَّا اللَّهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُونَ",
        "en": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. There is no might nor power except with Allah, none has the right to be worshipped except Allah and we worship none except Him. For Him is all favor, grace, and glorious praise. None has the right to be worshipped except Allah and we are sincere in faith and devotion to Him although the disbelievers detest it.",
        "source": "Muslim"
    },

    {
        "id": 139,
        "category": "Prayer & Masjid",
        "subcategory": "Remembrance after the Taslîm",
        "ar": "(١) سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ (ثلاثا و ثلاثين)(٢) لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
        "en": "(1) How perfect Allah is, all praise is for Allah, and Allah is the greatest. (Thirty-three times) (2) None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent.",
        "source": "Muslim"
    },

    {
        "id": 140,
        "category": "Prayer & Masjid",
        "subcategory": "Remembrance after the Taslîm",
        "ar": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (عشر مرات بعد المغرب و الصبح)",
        "en": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, He gives life and causes death and He is over all things omnipotent. (Ten times after Maghrib and Fajr prayer)",
        "source": "At-Tirmidhî"
    },

    {
        "id": 141,
        "category": "Prayer & Masjid",
        "subcategory": "Remembrance after the Taslîm",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (بعد السلام من صلاة الفجر)",
        "en": "O Allah, I ask You for knowledge which is beneficial and sustenance which is good, and deeds which are acceptable (To be said after giving salam for the fajr prayer).",
        "source": "Ibn Mâjah"
    },

    {
        "id": 142,
        "category": "Prayer & Masjid",
        "subcategory": "Du'â Qunût Al-Witr",
        "ar": "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ والَيْتَ، [وَ لَا يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
        "en": "O Allah, guide me along with those whom You have guided, pardon me along with those whom You have pardoned, be an ally to me along with those whom You are an ally to and bless for me that which You have bestowed. Protect me from the evil You have decreed for verily You decree and none can decree over You. For surety, he whom You show allegiance to is never abased and he whom You take as an enemy is never honoured and mighty. O our Lord, Blessed and Exalted are You.",
        "source": "Abû Dâwud"
    },

    {
        "id": 143,
        "category": "Prayer & Masjid",
        "subcategory": "Du'â Qunût Al-Witr",
        "ar": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالكَافِرِيْنَ ملْحَقٌ، اللَّهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الخَيْرَ، وَلَا نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
        "en": "O Allah, it is You we worship, and unto You we pray and prostrate, and towards You we hasten and You we serve. We hope for Your mercy and fear Your punishment, verily Your punishment will fall upon the disbelievers.O Allah, we seek Your aid and ask Your pardon, we praise You with all good and do not disbelieve in You.We believe in You and submit unto You, and we disown and reject those who disbelieve in You.",
        "source": "Al-Baihaqî"
    },

    {
        "id": 144,
        "category": "Prayer & Masjid",
        "subcategory": "Remembrance immediately after the Taslîm of the Witr Ŝalâh",
        "ar": "سُبْحَانَ المَلِكِ القُدُّوسِ (ثَلاثَ مَرَّاتٍ، وَ الثَّالِثَةُ يَجْهَرُ بِهَا وَيَمُدُّ صَوْتَهُ يَقُولُ:[ ربِّ المَلائِكَةِ وَالرُّوحِ])",
        "en": "How perfect The King, The Holy One is (Three times, and on the third time the Prophet would raise his voice, elongate it and add: [Lord of the angels and the Rûĥ.]).",
        "source": "An-Nisâ'i"
    },

    {
        "id": 145,
        "category": "Prayer & Masjid",
        "subcategory": "Supplication for one afflicted by whisperings in prayer or recitation",
        "ar": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، واتْفُلْ عَلَى يَساَرِكَ [ثَلاثاً]",
        "en": "I seek refuge in Allah from Shayťân The Accursed', and (dry) spit on your left side three times.",
        "source": "Muslim"
    },

    {
        "id": 146,
        "category": "Praise Allah",
        "subcategory": "Supplication for seeking guidance in forming a decision or choosing the proper course, etc..(Al-'Istikhârah)",
        "ar": "اللَّهُمَّ إِنِّي أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنْ هَذَاالأَمْرَ - ويُسَمِّي حَاجَتَه - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي - أو قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي، ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشي وَعَاقِبَةِ أَمْرِي – أوْ قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاصْرِفْهُ عَني، وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ.(١) وَ مَا نَدِمَ مَنْ اسْتَخَارَ الخَالِقَ، وَ شَاوَرَ المَخْلُوقِينَ المُؤمِنِينَ، وَ تَثَبَّتَ فِي أمْرِهِ، فَقَدْ قَالَ سُبْحَانَهُ: ﴿وَ شَاوِرْ هُمْ فِي الأَمْرِ فَإذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللهِ﴾(٢)",
        "en": "On the authority of Jaabir Ibn 'Abdullah (RA), he said: 'The Prophet (salla Allaahu 'alayhi wa salaam) would instruct us to pray for guidance in all of our concerns, just as he would teach us a chapter from the Qur'an. He (salla Allaahu 'alayhi wa salaam) would say 'If any of you intends to undertake a matter then let him pray two supererogatory units (Two Rak'ah nâfilah) of prayer and after which he should supplicate: 'O Allah, I seek Your counsel by Your knowledge and by Your power I seek strength and I ask You from Your immense favor, for verily You are able while I am not and verily You know while I do not and You are the Knower of the unseen. O Allah if You know this affair- and here he mentions his need- to be good for me in relation to my religion, my life, and end, then decree and facilitate it for me, and bless me with it, and if You know this affair to be ill for me towards my religion, my life and end, then remove it from me and remove me from it, and decree from me what is good and wherever it be and make me satisfied with such.'(١) One who seeks guidance from his Creator and consults his fellow believers and then remains firm in his resolve does not regret for Allah has said: {…and consult them in the affair. Then when you have taken a decision, put your trust in Allaah…}(٢)",
        "source": "Al-Bukhârî"
    },

    {
        "id": 147,
        "category": "Praise Allah",
        "subcategory": "Supplication for one whose affairs have become difficult",
        "ar": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذا شِئْتَ سَهْلاً",
        "en": "O Allah, there is no ease except in that which You have made easy, and You make the difficulty, if You wish, easy.",
        "source": "Ibn Ĥibbân"
    },

    {
        "id": 148,
        "category": "Praise Allah",
        "subcategory": "Upon committing a sin",
        "ar": "مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُاللهَ إلَّا غَفَرَ اللهُ لَهُ",
        "en": "Any servant who commits a sin and as a result, performs ablution, prays two raka'ahs of Ŝalah and then seeks Allah's forgiveness, Allah would forgive him.",
        "source": "Abû Dâwud"
    },

    {
        "id": 149,
        "category": "Praise Allah",
        "subcategory": "Supplication when stricken with a mishap or overtaken by an affair",
        "ar": "قَدَرُ اللهِ وَما شَاءَ فَعَلَ",
        "en": "Allah has decreed and what He wills, He does.",
        "source": "Muslim"
    },

    {
        "id": 150,
        "category": "Praise Allah",
        "subcategory": " Protection from the Dajjâl",
        "ar": "مَنْ حَفِظَ عَشَرَ آيَاتٍ مِنْ أوَّلِ سُورَةِ الكَهْفِ، عُصِمَ مِنَ الدَّجَّالِ",
        "en": "Whoever memorises the first ten verses of Sûrah Al-Kahf will be protected from the Dajjâl.",
        "source": "Muslim"
    },

    {
        "id": 151,
        "category": "Praise Allah",
        "subcategory": "Excellence of sending prayers upon the Prophet (May Allah send blessings and peace upon him)",
        "ar": "قَالَ ﷺ: «مَنْ صَلَّ عَلَيَّ صَلاةً صَلَّ اللهُ عَلَيْهِ بِهَا عَشَراً»",
        "en": "The Prophet (salla Allaahu 'alayhi wa salaam) said: 'Whoever sends a prayer upon me, Allah sends ten upon him.'",
        "source": "Muslim"
    },

    {
        "id": 152,
        "category": "Praise Allah",
        "subcategory": "Excellence of sending prayers upon the Prophet (May Allah send blessings and peace upon him)",
        "ar": "",
        "en": "",
        "source": ""
    },

    {
        "id": 153,
        "category": "Praise Allah",
        "subcategory": "Excellence of sending prayers upon the Prophet (May Allah send blessings and peace upon him)",
        "ar": "قَالَ ﷺ: «لا تَجْعَلُوا قَبْرِيْ عِيْداً وَصَلُّوا عَلَيَّ فَإِنَّ صَلاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ»",
        "en": "The Prophet (salla Allaahu 'alayhi wa salaam) said: 'Do not take my grave as a place of habitual ceremony. Send prayers upon me, for verily your prayers reach me wherever you are.'",
        "source": "Abû Dâwud"
    },

    {
        "id": 154,
        "category": "Praise Allah",
        "subcategory": "Excellence of sending prayers upon the Prophet (May Allah send blessings and peace upon him)",
        "ar": "قَالَ ﷺ: «البَخِيْلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ»",
        "en": "The Prophet (salla Allaahu 'alayhi wa salaam) said : 'A miser is one whom when I am mentioned to him, fails to send prayers upon me.'",
        "source": "At-Tirmidhî"
    },

    {
        "id": 155,
        "category": "Praise Allah",
        "subcategory": "Excellence of sending prayers upon the Prophet (May Allah send blessings and peace upon him)",
        "ar": "قَالَ ﷺ: «إنَّ لِلَّهِ مَلائِكَةً سَيَّاحِيْنَ فِي الأرْضِ، يُبَلِّغُونِي مِنْ أُمَّتِي السَّلامَ»",
        "en": "The Prophet (salla Allaahu 'alayhi wa salaam) said: 'Allah exalted He is has got angels scouring the earth to spread the salutations of my community.'",
        "source": "An-Nisâ'i"
    },

    {
        "id": 156,
        "category": "Praise Allah",
        "subcategory": "Excellence of sending prayers upon the Prophet (May Allah send blessings and peace upon him)",
        "ar": "قَالَ ﷺ: «مَا مِنْ أحَدٍ يُسَلِّمُ عَلَيَّ، إلَّا رَدَّ اللهُ عَلَيَّ رُوْحي، حَتَّى أرُدَّ عَلَيْهِ السَّلامَ»",
        "en": "The Prophet (salla Allaahu 'alayhi wa salaam) said: 'Every time somebody greets me, Allah gives me back my soul for me to answer this greeting.'",
        "source": "Abû Dâwud"
    },

    {
        "id": 157,
        "category": "Praise Allah",
        "subcategory": "How the Prophet (salla Allaahu 'alayhi wa salaam) made tasbîĥ?",
        "ar": "عَنْ عَبْدِ اللهِ بْنِ عَمْروٍ قَالَ: رَأيْتُ النَّبِيَّ يَعْقِدُ التَّسْبِيْحَ بِيَمِيْنِهِ",
        "en": "'Abdullah ibn 'Amr (RadiAllah 'anhu) said : I saw the Prophet (salla Allaahu ʻalayhi wa salaam) make tasbeeh with his right hand.",
        "source": "Abû Dâwud"
    },

    {
        "id": 158,
        "category": "Praise Allah",
        "subcategory": "Excellence of At-Tasbîĥ, At-Taĥmîd, At-Tahlîl and At-Takbîr",
        "ar": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ فِي يَومٍ مِئَةَ مَرَّةٍ، حُطَّتْ خَطَايَاهُ، وَ لَو كَانَتْ مِثْلَ زَبَدِ البَحْرِ»",
        "en": "How perfect Allah is and I praise Him. (One Hundred times daily)",
        "source": "Al-Bukhârî"
    },

    {
        "id": 159,
        "category": "Praise Allah",
        "subcategory": "Excellence of At-Tasbîĥ, At-Taĥmîd, At-Tahlîl and At-Takbîr",
        "ar": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مِرَارٍ، كَانَ كَمَنْ أعْتَقَ أرْبَعَةَ أنْفُسٍ مِنْ وَلَدِ إسْمَاعِيلَ»",
        "en": "None has the right to be worshipped except Allah, alone, without partner. To Him belongs all sovereignty and praise and He is over all things omnipotent. (Ten times)",
        "source": "Al-Bukhârî"
    },

    {
        "id": 160,
        "category": "Praise Allah",
        "subcategory": "Excellence of At-Tasbîĥ, At-Taĥmîd, At-Tahlîl and At-Takbîr",
        "ar": "قَالَ رَسُولُ اللهِ ﷺ: «كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الِميْزَانِ، حَبِيبَتَانِ إلَى الرَّحْمَنِ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ، سُبْحَانَ اللهِ العَظِيْمِ»",
        "en": "The Messenger of Allah (salla Allaahu ʻalayhi wa salaam) said: There are two words (phrases), (which are) light on the tongue, heavy on the scale and beloved to The Most Gracious: 'How perfect Allah is and I praise Him.' (and) 'How perfect Allah is, The Supreme.'",
        "source": "Al-Bukhârî"
    },

    {
        "id": 161,
        "category": "Praise Allah",
        "subcategory": "Excellence of At-Tasbîĥ, At-Taĥmîd, At-Tahlîl and At-Takbîr",
        "ar": "قَالَ رَسُولُ اللهِ ﷺ: «لَأنْ أقُولَ: سُبْحَانَ اللهِ، وَ الحَمْدُ لِلَّهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، أحَبُّ إلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ»",
        "en": "The Messenger of Allah (salla Allaahu 'alayhi wa salaam) said : Saying How perfect Allah is, and all praise is for Allah. None has the right to be worshipped except Allah, and Allah is the greatest', is more beloved to me than everything the Sun has risen over.",
        "source": "Muslim"
    },

    {
        "id": 162,
        "category": "Praise Allah",
        "subcategory": "Excellence of At-Tasbîĥ, At-Taĥmîd, At-Tahlîl and At-Takbîr",
        "ar": "قَالَ رَسُولُ اللهِ ﷺ: «أيَعْجِزُ أحَدُكُمْ أنْ يَكْسِبَ كُلَّ يَوْمٍ ألْفَ حَسَنَةٍ» فَسَألَهُ سَائِلٌ مِنْ جُلَسَائِهِ: كَيْفَ يَكْسِبُ أحَدُنَا ألْفَ حَسَنَةٍ؟ قَالَ: «يُسَبِّحُ مِئَةَ تَسْبِيْحَةٍ، فَيُكْتَبُ لَهُ ألْفُ حَسَنَةٍ، أوْ يُحَطُّ عَنْهُ ألْفُ خَطِيْئَةٍ»",
        "en": "How perfect Allah is and I praise Him. (One Hundred times)",
        "source": "Muslim"
    },

    {
        "id": 163,
        "category": "Praise Allah",
        "subcategory": "Excellence of At-Tasbîĥ, At-Taĥmîd, At-Tahlîl and At-Takbîr",
        "ar": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ العَظِيمِ وَ بِحَمْدِهِ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الجَنَّةِ»",
        "en": "Whoever says: 'How perfect Allah is, The Supreme, and I praise Him', a palm tree is planted for him in paradise.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 164,
        "category": "Hajj & Umrah",
        "subcategory": "The Talbiyah for the one doing Ĥajj or 'Umra",
        "ar": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ والنِّعْمَةَ، لَكَ وَالمُلْكَ، لَا شَرِيْكَ لَكَ",
        "en": "Here I am O Allah, (in response to Your call), here I am. Here I am, You have no partner, here I am. Verily all praise, grace and sovereignty belong to You. You have no partner.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 165,
        "category": "Hajj & Umrah",
        "subcategory": "The Takbîr passing the black stone",
        "ar": "اللهُ أَكْبَرُ",
        "en": "Allah is the greatest.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 166,
        "category": "Hajj & Umrah",
        "subcategory": "Between the Yemeni corner and the black stone",
        "ar": "﴿رَبَّنَا آتِنَا في الدُّنْيَا حَسَنَةً وفي الآخِرَةِ حَسَنَةً وقِنَا عَذَابَ النَّارِ﴾",
        "en": "O our Lord, grant us the best in this life and the best in the next life, and protect us from the punishment of the Fire.",
        "source": "Abû Dâwud"
    },

    {
        "id": 167,
        "category": "Hajj & Umrah",
        "subcategory": "When at Mount Ŝaffâ and Mount Marwah",
        "ar": "لَمَّا دَنَا النَّبِيُّ ﷺ مِنَ الصَّفَا قَرَأ: ﴿إنَّ الصَّفَا وَ المَرْوَةَ مِنْ شَعَائِرِ اللهِ﴾«أبْدَأ بِمَا بَدَأ اللهُ بِهِ» فَبَدأ بِالصَّفَا، فَرَقِيَ عَلَيْهِ، حَتَّى رَأَى البَيْتَ، فَاسْتَقْبَلَ القِبْلَةَ، فَوَحَّدَ اللهَ، وَ كَبَّرَهُ، وَ قَالَ: «لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لَا إلَهَ إلَّا اللهٌ وَ حْدَهُ، أنْجَزَ وَعْدَهُ، وَ نَصَرَ عَبْدَهُ، وَ هَزَمَ الأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذَلِكَ، قَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ...، الحَدِيْثُ، وَ فِيْهِ: فَفَعَلَ عَلَى المَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا»",
        "en": "Indeed Safa and Marwah are from the places of worship of Allah…None has the right to be worshipped except Allah, Allah is the greatest. None has the right to be worshipped except Allah, alone, without partner. To Him belongs all sovereignty and praise and He is over all things amnipotent. None has the right to be worshipped except Allah alone. He fulfilled His promise, aided His Servant and single-handedly defeated the allies.",
        "source": "Muslim"
    },

    {
        "id": 168,
        "category": "Hajj & Umrah",
        "subcategory": "On the Day of 'Arafah",
        "ar": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
        "en": "None has the right to be worshipped except Allah, alone, without partner. To Him belongs all praise and sovereignty and He is over all things omnipotent.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 169,
        "category": "Hajj & Umrah",
        "subcategory": "When slaughtering or offering a sacrifice",
        "ar": "بِسْمِ اللهِ واللهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ ولَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي",
        "en": "In the name of Allah, and Allah is the greatest. O Allah, (it is) from You and belongs to You, O Allah, accept this from me.",
        "source": "Muslim"
    },

    {
        "id": 170,
        "category": "Hajj & Umrah",
        "subcategory": "Supplication for throwing a pebble at the Jamarât",
        "ar": "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الجِمَارِ الثَّلاثِ، ثُمَّ يَتَقَدَّمُ، وَ يَقِفُ يَدْعُوْ مُسْتَقْبِلَ القِبْلَةَ، رَافِعاً يَدَيْهِ بَعْدَ الجَمْرَةِ الأوْلَى وَ الثَّانِيَةِ، أمَّا جَمْرَةُ العَقَبَةِ فَيَرْمِيْهَا، وَ يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ، وَ يَنْصَرِفُ، وَ لَا يَقِفُ عِنْدَهَا",
        "en": "",
        "source": "Al-Bukhârî"
    },

    {
        "id": 171,
        "category": "Dua in Sickness",
        "subcategory": "What to say and do when feeling some pain in the body",
        "ar": "بِسْمِ اللهِ (ثَلاثاً)أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.(سَبْعَ مَرَّاتٍ)",
        "en": "Recite 'In the name of Allah.' (three times) followed by ''I take refuge in Allah and within His omnipotence from the evil that I feel and am wary of.' (seven times).",
        "source": "Muslim"
    },

    {
        "id": 172,
        "category": "Dua in Sickness",
        "subcategory": "Placing children under Allah's protection",
        "ar": "أُعِيْذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ، مِنْ كُلِّ شَيْطَانٍ وَهـَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لامَّةٍ",
        "en": "I commend you to the protection of Allah's perfect words from every devil, vermin, and every evil eye.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 173,
        "category": "Dua in Sickness",
        "subcategory": "When visiting the sick",
        "ar": "لَا بأْسَ طَهُورٌ إِنْ شَاءَ اللهُ",
        "en": "Never mind, may it (the sickness) be a purification, if Allah wills.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 174,
        "category": "Dua in Sickness",
        "subcategory": "When visiting the sick",
        "ar": "أَسْأَلُ اللهَ العَظِيْمَ، رَبَّ العَرْشِ العَظِيْمِ، أَنْ يَشْفِيَكَ [سَبْعَ مَرَّاتٍ]",
        "en": "I ask Allah The Supreme, Lord of the magnificent throne to cure you. (Seven times)",
        "source": "At-Tirmidhî"
    },

    {
        "id": 175,
        "category": "Dua in Sickness",
        "subcategory": "Excellence of visiting the sick",
        "ar": "إذَا عَادَ الرَّجُلُ أخَاهُ المُسْلِمَ، مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ، فَإذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ، فَإنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُمْسِيَ، و إنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُصْبِحَ",
        "en": "If a man calls on his sick Muslim brother, it is as if he walks reaping the fruits of Paradise until he sits, and when he sits he is showered in mercy, and if this was in the morning, seventy thousand angles send prayers upon him until the evening, and if this was in the evening, seventy thousand angles send prayers upon him until the morning.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 176,
        "category": "Dua in Sickness",
        "subcategory": "Supplication of the sick who have renounced all hope of life",
        "ar": "اللَّهُمَّ اغْفِرْ لي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيْقِ الأعْلَى",
        "en": "O Allah, forgive me, have mercy upon me and unite me with the higher companions.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 177,
        "category": "Dua in Sickness",
        "subcategory": "Supplication of the sick who have renounced all hope of life",
        "ar": "لَا إِلَهَ إِلَّا اللهُ، إِنَّ لِلْمَوْتِ لَسَكَرَاتٍ",
        "en": "None has the right to be worshipped except Allah, death does indeed contain agony.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 178,
        "category": "Dua in Sickness",
        "subcategory": "Supplication of the sick who have renounced all hope of life",
        "ar": "لَا إلَهَ إلَّا اللهُ وَاللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وحْدَهُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لَا إلَهَ إلَّا اللهُ لَهُ المُلْكُ ولَهُ الحَمْدُ، لَا إلَهَ إلَّا اللهُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
        "en": "None has the right to be worshipped except Allah and Allah is the greatest.None has the right to be worshipped except Allah, alone.None has the right to be worshipped except Allah, alone, without partner.None has the right to be worshipped except Allah, to Him belongs all sovereignty and praise. None has the right to be worshipped except Allah and there is no might and no power except with Allah.",
        "source": ""
    },

    {
        "id": 179,
        "category": "Food & Drink",
        "subcategory": "Supplication said by one fasting when presented with food and does not break his fast",
        "ar": "إذَا دُعِيَ أحَدُكُمْ فَلْيُجِبْ، فَإنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَ إنْ كَانَ مُفْطِراً فَلْيَطْعَمْ (وَ مَعنَى فَلْيُصَلِّ؛ أيْ: فَلْيَدْعُ)",
        "en": "If you are invited (to a meal) then accept. If you happen to be fasting, then pray (for those present) and if you are not fasting, then eat. (The meaning of 'pray' here means 'supplicate').",
        "source": "Muslim"
    },

    {
        "id": 180,
        "category": "Food & Drink",
        "subcategory": "Upon breaking fast",
        "ar": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأجْرُ إِنْ شَاءَ اللهُ",
        "en": "The thirst has gone and the veins are quenched, and reward is confirmed, if Allah wills.",
        "source": "Abû Dâwud"
    },

    {
        "id": 181,
        "category": "Food & Drink",
        "subcategory": "Upon breaking fast",
        "ar": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ، أَنْ تَغْفِرَ لِي",
        "en": "O Allah, I ask You by Your mercy which envelopes all things, that You forgive me.",
        "source": "Ibn Mâjah"
    },

    {
        "id": 182,
        "category": "Food & Drink",
        "subcategory": "Supplication before eating",
        "ar": "بِسْمِ اللهِ (في أَوَّلِهِ وَآخِرِهِ)",
        "en": "In the name of Allah (in its beginning and end)*",
        "source": "Abû Dâwud"
    },

    {
        "id": 183,
        "category": "Food & Drink",
        "subcategory": "Supplication before eating",
        "ar": "(١) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَأَطْعِمْنَا خَيْراً مِنْهُ (٢) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَزِدْنَا مِنْهُ",
        "en": "(1) 'O Allah, bless it for us and feed us better than it.' If one is given milk, recite the following instead: (2) 'O Allah, bless it fo it for usand give us more of it.'",
        "source": "Abû Dâwud"
    },

    {
        "id": 184,
        "category": "Food & Drink",
        "subcategory": "Upon completion of a meal",
        "ar": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هـَذَا، وَرَزَقَنِيْهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّة",
        "en": "All praise is for Allah who fed me this and provided it for me without any might nor power from myself.",
        "source": "Abû Dâwud"
    },

    {
        "id": 185,
        "category": "Food & Drink",
        "subcategory": "Upon completion of a meal",
        "ar": "الْحَمْدُ لِلَّهِ حَمْداً كَثِيْراً طَيِّباً مُبَارَكاً فِيْهِ، غَيْرَ [مَكْفِيٍّ وَلَا] مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبُّنَا",
        "en": "Allah be praised with an abundant beautiful blessed praise, a never-ending praise, a praise which we will never bid farewell to and an indispensable praise, He is our Lord.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 186,
        "category": "Food & Drink",
        "subcategory": "Supplication said when breaking fast in someone's home",
        "ar": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ",
        "en": "May the fasting break their fast in your home, and may the dutiful and pious eat your food, and may the angles send prayers upon you.",
        "source": "Abû Dâwud"
    },

    {
        "id": 187,
        "category": "Death & Funeral",
        "subcategory": "Instruction for the one nearing death",
        "ar": "لَا إلَهَ إلَّا اللهُ",
        "en": "He, whose last words are 'None has the right to be worshipped except Allah', will enter Jannah.",
        "source": "Abû Dâwud"
    },

    {
        "id": 188,
        "category": "Death & Funeral",
        "subcategory": "When closing the eyes of the deceased",
        "ar": "اللَّهُمَّ اغْفِرْ لِفُلانٍ (باسْمِهِ)، وَارْفَعْ دَرَجَتَهُ في المَهْدِيِّيْنَ، وَاخْلُفْهُ في عَقِبِهِ في الغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ العَالَمِيْنَ، وَافْسَحْ لَهُ في قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ",
        "en": "O Allah, forgive (name of deceased) and raise his rank among the rightly guided, and be a successor to whom he has left behind, and forgive us and him O Lord of the worlds. Make spacious his grave and illuminate it for him.",
        "source": "Muslim"
    },

    {
        "id": 189,
        "category": "Death & Funeral",
        "subcategory": "Supplication for the deceased at the funeral prayer",
        "ar": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّـلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ داراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ(وَ عَذَابِ النَّارِ)",
        "en": "O Allah, forgive and have mercy upon him, excuse him and pardon him, and make honourable his reception. Expand his entry, and cleanse him with water, snow, and ice, and purify him of sin as a white robe is purified of filth. Exchange his home for a better home, and his family for a better family, and his spouse for a better spouse. Admit him into the Garden, protect him from the punishment of the grave (and the torment of the Fire).",
        "source": "Muslim"
    },

    {
        "id": 190,
        "category": "Death & Funeral",
        "subcategory": "Aupplication for the deceased at the funeral prayer",
        "ar": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغَائِبِنَا، وَصَغِيْرِنَا، وَكَبِيْرِنَا، وَذَكَرِنَا، وَأُنْثَانَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ، اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ، وَلَا تُضِلَّنَا بَعْدَهُ",
        "en": "O Allah, forgive our living and our dead, those present and those absent, our young and our old, our males and our females. O Allah, whom amongst us You keep alive, then let such a life be upon Islam, and whom amongst us You take unto Yourself, then let such a death be upon faith. O Allah, do not deprive us of his reward and do not let us stray after him.",
        "source": "Ibn Mâjah"
    },

    {
        "id": 191,
        "category": "Death & Funeral",
        "subcategory": " Supplication for the deceased at the funeral prayer",
        "ar": "اللَّهُمَّ إِنَّ فُلانَ بْنَ فُلانٍ في ذِمَّتِكَ، وَحَبْلِ جِوارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ، وَارْحَمْهُ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيْمُ",
        "en": "O Allah, so-and-so is under Your care and protection so protect him from the trial of the grave and torment of the Fire. Indeed You are faithful and truthful. Forgive and have mercy upon him, surely You are The Oft-Forgiving, The Most-Merciful.",
        "source": "Ibn Mâjah"
    },

    {
        "id": 192,
        "category": "Death & Funeral",
        "subcategory": "Supplication for the deceased at the funeral prayer",
        "ar": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ، احْتَاجَ إِلى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ في حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيْئاً فَتَجَاوَزْ عَنْهُ",
        "en": "O Allah, Your servant and the son of Your maidservant is in need of Your mercy and You are without need of his punishment. If he was righteous then increase his reward and if he was wicked then look over his sins.",
        "source": "Al-Hâkim"
    },

    {
        "id": 193,
        "category": "Death & Funeral",
        "subcategory": "Supplication for the deceased child at the funeral prayer",
        "ar": "اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوالِدَيْهِ، وَشَفِيْعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وَأَعْظِمْ بِهِ أُجـُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المُؤْمِنِيْنَ، وَاجْعَلْهُ في كَفَالَةِ إِبْرَاهـِيْمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيْمِ، و أبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، و أهْلاً خَيْراً مِنْ أهْلِهِ، اللهم اغْفِرْ لأسْلاَفِنَا، وَ أفْرَاطِنَا، وَ مَنْ سَبَقَنَا باِلإيْمَانِ",
        "en": "O Lord, make him a preceding reward and a stored treasure for his parents, and an answered intercessor. O Allah, through him, make heavy their scales and magnify their reward. Unite him with the righteous believers, place him under the care of Ibraheem, and protect him by Your mercy from the torment of Hell. Give him in exchange a better residence and a better family than his. O Allah, forgive our ancestors and our descendants and those who came before us with faith.",
        "source": "Ibn Qudâmah"
    },

    {
        "id": 194,
        "category": "Death & Funeral",
        "subcategory": "Supplication for the deceased child at the funeral prayer",
        "ar": "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً",
        "en": "O Allah, make him a preceding reward, a prepayment and a recompense for us.",
        "source": "Al-Baghawî"
    },

    {
        "id": 195,
        "category": "Death & Funeral",
        "subcategory": "Condolence",
        "ar": "إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّىً...فَلْتَصْبِرْ وَ لْتَحْتَسِبْ",
        "en": "Verily to Allah, belongs what He took and to Him belongs what He gave, and everything with Him has an appointed time.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 196,
        "category": "Death & Funeral",
        "subcategory": "Placing the deceased in the grave",
        "ar": "بِسْمِ اللهِ، وَعَلَى سُنَّةِ رَسُولِ اللهِ",
        "en": "In the name of Allah and upon the sunnah of the Messenger of Allah.",
        "source": "Abû Dâwud"
    },

    {
        "id": 197,
        "category": "Death & Funeral",
        "subcategory": "After burying the deceased",
        "ar": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
        "en": "O Allah, forgive him, O Allah, protect him.",
        "source": "Abû Dâwud"
    },

    {
        "id": 198,
        "category": "Death & Funeral",
        "subcategory": "Visiting the graves",
        "ar": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ المُؤْمِنِيْنَ، وَالْمُسْلِمِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ، [وَ يَرْ حَمُ اللهُ المُسْتَقْدِمِيْنَ مِنَّا وَ المُسْتَأخِرِيْنَ] أسْألُ اللهَ لَنَا وَلَكُمْ العَافِيَةَ",
        "en": "Peace be upon you all, O inhabitants of the graves, amongst the believers and the Muslims. Verily we will, Allah willing, be united with you, we ask Allah for well-being for us and you.",
        "source": "Muslim"
    },

    {
        "id": 199,
        "category": "Entering & Exiting",
        "subcategory": "Before entering the toilet",
        "ar": "(بِسْمِ اللهِ) اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
        "en": "(In the name of Allah). O Allah, I take refuge with you from all evil and evil-doers.",
        "source": "Al-Bukhârî"
    },

    {
        "id": 200,
        "category": "Entering & Exiting",
        "subcategory": "After leaving the toilet",
        "ar": "غُفْرَانَكَ",
        "en": "I ask You (Allah) for forgiveness.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 201,
        "category": "Entering & Exiting",
        "subcategory": "When leaving home",
        "ar": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
        "en": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah.",
        "source": "Abû Dâwud"
    },

    {
        "id": 202,
        "category": "Entering & Exiting",
        "subcategory": "When leaving home",
        "ar": "اللَّهُمَّ إِنَّي أَعْوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضِلَّ، أَوْ أَزِلَّ، أُوْ أُزَلَّ أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
        "en": "O Allah, I take refuge with You lest I should stray or be led astray, or slip or be tripped, or oppress or be oppressed, or behave foolishly or be treated foolishly.",
        "source": "Abû Dâwud"
    },

    {
        "id": 203,
        "category": "Entering & Exiting",
        "subcategory": "Upon entering home",
        "ar": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللهِ رَبَّنَا تَوَكَّلْنَا",
        "en": "In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust.",
        "source": "Abû Dâwud"
    },

    {
        "id": 204,
        "category": "Entering & Exiting",
        "subcategory": "Supplication upon entering a town or village, etc...",
        "ar": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرْاضِيْنَ السَّبْعِ وَمَا أقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيْهَا",
        "en": "O Allah, Lord of the seven heavens and all that they envelop, Lord of the seven earths and all that they carry, Lord of the devils and all whom they misguide, Lord of the winds and all whom they whisk away. I ask You for the goodness of this village, the goodness of its inhabitants and for all the goodness found within it and I take refuge with You from the evil of this village, the evil of its inhabitants and from all the evil found within it.",
        "source": "Al-Hâkim"
    },

    {
        "id": 205,
        "category": "Entering & Exiting",
        "subcategory": "When entering the market",
        "ar": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، يُحْيِي وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
        "en": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise. He gives life and causes death, and He is living and does not die. In His hand is all good and He is over all things, omnipotent.",
        "source": "At-Tirmidhî"
    },

    {
        "id": 206,
        "category": "Protection from Evil",
        "subcategory": "Against enemies",
        "ar": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الأحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُمْ",
        "en": "O Allah, Revealer of the Book, Swift at reckoning, defeat the confederates. O Allah, defeat them and convulse them.",
        "source": "Muslim"
    },

    {
        "id": 207,
        "category": "Protection from Evil",
        "subcategory": "When afraid of a group people",
        "ar": "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
        "en": "O Allah, protect me from them with what You choose.",
        "source": "Muslim"
    },

    {
        "id": 208,
        "category": "Protection from Evil",
        "subcategory": "Supplications for expelling the devil and his whisperings",
        "ar": "الاسْتِعَاذَةُ بِاللهِ مِنْهُ",
        "en": "Seek refuge in Allah from him",
        "source": "Abû Dâwud"
    }
]
